parents = ['レディース','メンズ','インテリア・住まい・小物','本・音楽・ゲーム','おもちゃ・ホビー・グッズ','コスメ・香水・美容','家電・スマホ・カメラ','スポーツ・レジャー', 'その他']

parents.each do |parent|
  Category.create!(
    name: parent,
  )
end


children = [["トップス", 1], ["ジャケット/アウター", 1], ["パンツ", 1], ["スカート", 1], ["ワンピース", 1], ["靴", 1], ["ルームウェア/パジャマ", 1], ["帽子", 1], ["バッグ", 1], ["アクセサリー", 1], ["時計", 1], ["その他", 1],
            ["トップス", 2], ["ジャケット/アウター", 2], ["パンツ", 2], ["靴", 2], ["バッグ", 2], ["スーツ", 2], ["帽子", 2], ["アクセサリー", 2], ["小物", 2],["時計", 2], ["水着", 2], ["その他", 2],
            ["キッチン", 3], ["ベッド", 3], ["ソファ", 3], ["椅子", 3], ["机", 3], ["家具", 3], ["カーペット", 3], ["カーテン", 3], ["ライト", 3], ["インテリア", 3], ["その他", 3],
            ["本", 4], ["漫画", 4], ["雑誌", 4], ["CD", 4], ["DVD", 4], ["GAME", 4], 
            ["おもちゃ", 5], ["グッズ", 5], ["カード", 5], ["フィギュア", 5], ["楽器", 5], ["コレクション", 5], ["ミリタリー", 5], ["美術品", 5], ["アート", 5], ["その他", 5], 
            ["ベースメイク", 6], ["メイクアップ", 6], ["ネイルケア", 6], ["香水", 6], ["スキンケア", 6], ["ヘアケア", 6], ["ボディケア", 6], ["オーラルケア", 6], ["その他", 6],
            ["スマートフォン", 7], ["アクセサリー", 7], ["PC", 7], ["カメラ", 7], ["テレビ", 7], ["オーディオ", 7], ["美容", 7], ["冷暖房", 7], ["生活家電", 7], ["その他", 7], 
            ["ゴルフ", 8], ["フィッシング", 8], ["トレーニング", 8], ["野球", 8], ["サッカー", 8], ["テニス", 8], ["スキー", 8], ["スノーボード", 8], ["アウトドア", 8], ["その他", 8], 
            ["まとめ売り", 9], ["ペット用品", 9], ["食品", 9], ["飲料", 9], ["その他", 9]]
            
children.each do |child,num|
  parent = Category.find(num)
  parent.children.create!(
    name: child,
  )
end