grandchildren = [["シャツ", 11], ["キャミソール", 12], ["その他", 13],
                 ["レザー", 14], ["コート", 15], ["その他", 16],
                 ["ハーフ", 17], ["ショート", 18], ["その他", 19],
                 ["ショート", 20], ["ロング", 21], ["その他", 22],
                 ["ミニ", 23], ["ロング", 24], ["その他", 25],
                 ["スニーカー", 26], ["ブーツ", 27], ["その他", 28],
                 ["ミニ", 29], ["ロング", 30], ["その他", 31],
                 ["ハット", 32], ["キャップ", 33], ["その他", 34],
                 ["ハンド", 35], ["リュック", 36], ["その他", 37],
                 ["リング", 38], ["ピアス", 39], ["その他", 40],
                 ["デジタル", 41], ["アナログ", 42], ["その他", 43],
                 ["シャツ", 44], ["ポロシャツ", 45], ["その他", 46],
                 ["レザー", 47], ["コート", 48], ["その他", 49],
                 ["ハーフ", 50], ["ショート", 51], ["その他", 52],
                 ["スニーカー", 53], ["ブーツ", 54], ["その他", 55],
                 ["ハンド", 56], ["リュック", 57], ["その他", 58],
                 ["ベスト", 59], ["ジャケット", 60], ["その他", 61],
                 ["ハット", 62], ["キャップ", 63], ["その他", 64],
                 ["デジタル", 65], ["アナログ", 66], ["その他", 67],
                 ["一般", 68], ["スポーツ", 69], ["その他", 70]]
grandchildren.each do |grandchild,num|
  child = Category.find(num)
  child.children.create!(
    name: grandchild,
  )
end