app/views/items/edit.html.haml

            //JSで挿入したhtmlと同じ形 each文でのプレビュー表示
            - @item.images.each do |image|
              .preview-box
                .upper-box
---
SELECT `images`.* FROM `images` WHERE `images`.`item_id` = 6