app/views/items/show.html.haml

          %br
          - @item.images.each do |i|
---
SELECT `images`.* FROM `images` WHERE `images`.`item_id` = 1