app/controllers/items_controller.rb

  def show
    @user = User.find(@item.seller_id)
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1

  def edit
    if user_signed_in? && @item.seller_id == current_user.id
      @parents = Category.where(ancestry:nil)
      # 編集する商品を選択
      @item = Item.find(params[:id])
      # 登録されている商品の孫カテゴリーのレコードを取得
      @selected_grandchild_category = @item.category
      # 孫カテゴリー選択肢用の配列作成
      @category_grandchildren_array = [{id: "---", name: "---"}]
      Category.find("#{@selected_grandchild_category.id}").siblings.each do |grandchild|
---
SELECT  `categories`.* FROM `categories` WHERE `categories`.`id` = 2 LIMIT 1