app/controllers/items_controller.rb

INSERT INTO `items` (`name`, `price`, `description`, `size`, `item_status`, `delivery_charge`, `delivery_area`, `shipment`, `seller_id`, `created_at`, `updated_at`) VALUES ('saba', 10, 'test', '50cm', 0, 0, 'tokyo', 0, 1, '2020-02-03 09:25:59', '2020-02-03 09:25:59')
---
  def create
    @item = Item.new(item_params)
    if @item.save

SELECT  `items`.* FROM `items` WHERE `items`.`id` = 6 LIMIT 1
UPDATE `items` SET `name` = '123456789', `description` = '12345678', `price` = 123, `size` = 'tai', `delivery_area` = '123456y', `updated_at` = '2020-02-06 11:56:50' WHERE `items`.`id` = 7
---
  def update
    @item = Item.find(params[:id])
    if @item.update(item_params)

SELECT  `categories`.* FROM `categories` WHERE `categories`.`id` = 2 LIMIT 1
---
  def get_category_grandchildren
    @category_grandchildren = Category.find("#{params[:child_id]}").children