app/controllers/users/registrations_controller.rb

INSERT INTO `users` (`nick_name`, `family_name`, `first_name`, `family_name_kana`, `first_name_kana`, `birthday`, `email`, `encrypted_password`, `created_at`, `updated_at`) VALUES ('hoge', 'hoge', 'hoge', 'hoge', 'hoge', '', 'sssssssss@1', '$2a$11$F.AerGuss4ZgEoRZ3M5q1ujIAPYlCpat22rvStTTYUvwkFNaDlf66', '2020-02-10 07:27:19', '2020-02-10 07:27:19')
---
  def create
    @user = User.new(user_params)
    if @user.save